src/cf/InformationRegisters/бпсРегистрАдресации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>бпсРегистрАдресации</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РольАдресации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бпсРолиАдресации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПодразделениеАдресации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бпсПодразделенияАдресации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/бпсРегистрАдресации/Ext/ManagerModule.bsl
Функция ПолучитьПользователяАдресации(РольАдресации,ПодразделениеАдресации) Экспорт
	
	ПользовательАдресации = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	бпсРегистрАдресации.Пользователь КАК Пользователь
		|ИЗ
		|	РегистрСведений.бпсРегистрАдресации КАК бпсРегистрАдресации
		|ГДЕ
		|	бпсРегистрАдресации.РольАдресации = &РольАдресации
		|	И бпсРегистрАдресации.ПодразделениеАдресации = &ПодразделениеАдресации";
	
	Запрос.УстановитьПараметр("ПодразделениеАдресации", ПодразделениеАдресации);
	Запрос.УстановитьПараметр("РольАдресации", РольАдресации);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		ПользовательАдресации = ВыборкаДетальныеЗаписи.Пользователь;
	КонецЕсли;
	
	Возврат ПользовательАдресации;

КонецФункции
